In [2]:
# Import the libraries we need
import pandas as pd
import sqlite3

print("Libraries imported successfully!")
print(f"pandas version: {pd.__version__}")
print(f"sqlite3 version: {sqlite3.sqlite_version}")

Libraries imported successfully!
pandas version: 2.2.3
sqlite3 version: 3.45.3

In [5]:

# Load the Titanic dataset from CSV
titanic_df = pd.read_csv('Titanic Dataset (1).csv')

# Display basic information about the dataset
print(f"Dataset shape: {titanic_df.shape[0]} rows, {titanic_df.shape[1]} columns")
print(f"\nColumn names: {list(titanic_df.columns)}")

Dataset shape: 1309 rows, 14 columns

Column names: ['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [6]:
# Let's look at the first few rows
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
# If 'titanic.db' doesn't exist, this will create it
conn = sqlite3.connect('titanic.db')  # Opens the 'titanic.db' database file and gives us a connection object to work with it

print("Connected to database 'titanic.db'")
print("   (If the file didn't exist, it was just created!)")

Connected to database 'titanic.db'
   (If the file didn't exist, it was just created!)

In [8]:
# Convert the DataFrame to a SQL table
titanic_df.to_sql(
    name='passengers',           # The name of the SQL table we want to create in the database
    con=conn,                    # The active database connection (created with sqlite3.connect)
    if_exists='replace',         # If a table named 'passengers' already exists, delete it and write a new one
    index=False                  # Don't store the DataFrame's index as its own column in the database
)


print("Data written to database (no errors reported).")
print(f"Expected rows written: {len(titanic_df)}")
print("Next steps will validate/verify the new db using SQL queries!")

Data written to database (no errors reported).
Expected rows written: 1309
Next steps will validate/verify the new db using SQL queries!

In [9]:
query = "SELECT * FROM passengers LIMIT 5"   # 1. Write SQL query as a string
result = pd.read_sql(query, conn)              # 2. Run query using pandas + active DB connection
print("First 5 passengers from database:")   # 3. Optional: A label for clarity
result

First 5 passengers from database:

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

In [10]:

# Pandas way (from Lesson 01)
print("PANDAS WAY:")                      # Label to show we're displaying the DataFrame using pandas tools
print(f"Shape: {titanic_df.shape}")       # Shows the number of rows and columns in the DataFrame as a tuple (rows, columns)
display(titanic_df.head(3))               # Displays the first 3 rows so we can preview the data structure

PANDAS WAY:
Shape: (1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:

# SQL way (new!)
print("SQL WAY:")                                # Label to show we're now previewing the data using an SQL query instead of pandas-only methods
query = "SELECT * FROM passengers LIMIT 3"       # SQL command asking for all columns but only the first 3 rows from the passengers table
result = pd.read_sql(query, conn)                # Runs the SQL query through our database connection and returns the result as a pandas DataFrame
print(f"Shape: {result.shape}")                  # Prints the number of rows and columns returned by the SQL query
display(result)                                  # Displays the query results so we can compare SQL output with pandas output

SQL WAY:
Shape: (3, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,None,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,None,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,None,"Montreal, PQ / Chesterville, ON"

In [12]:
# Pandas way (from Lesson 02)
print("PANDAS WAY:")                                                    # Label to show we're previewing data using pandas tools
pandas_result = titanic_df[['name', 'age', 'sex', 'survived']].head()   # Selects specific columns and returns the first 5 rows
display(pandas_result)

PANDAS WAY:

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0

In [13]:

# SQL way
print("SQL WAY:")                                                        # Label to show we're previewing data using an SQL query
query = "SELECT Name, Age, Sex, Survived FROM passengers LIMIT 5"        # SQL command selecting specific columns and the first 5 rows
sql_result = pd.read_sql(query, conn)                                    # Sends the SQL query through the database connection and returns a DataFrame
display(sql_result)                                                      # Displays the SQL query result so we can view the sample output

SQL WAY:

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0

In [16]:
query = "select * FROM passengers LIMIT 10"
print(query)

select * FROM passengers LIMIT 10

In [17]:
# Pandas way
print("PANDAS WAY:")
print(f"Total passengers: {len(titanic_df)}")

PANDAS WAY:
Total passengers: 1309

In [18]:

# SQL way
print("SQL WAY:")
query = "SELECT COUNT(*) as total_passengers FROM passengers"
result = pd.read_sql(query, conn)
print(f"Total passengers: {result['total_passengers'][0]}")

SQL WAY:
Total passengers: 1309

In [19]:

# Query to see all tables in the database
query = "SELECT name FROM sqlite_master WHERE type='table'"                   # SQL query asking SQLite to list all table names in the database
tables = pd.read_sql(query, conn)                                             # Runs the query through our database connection and returns the results as a DataFrame
print("Tables in database:")                                                  # Label explaining that we are about to display the list of tables
display(tables)                                                               # Shows the table list returned from the SQL query

Tables in database:

         name
0  passengers

In [20]:

# Get column information using PRAGMA
query = "PRAGMA table_info(passengers)"                   # PRAGMA = SQLite's "info" command; this one lists every column in the 'passengers' table
columns_info = pd.read_sql(query, conn)                   # Runs the PRAGMA query and returns the column details as a pandas DataFrame
print("Column information for 'passengers' table:")       # Label explaining that we are about to display the table's column names and data types
display(columns_info[['name', 'type']])                   # Shows only the column names and their data types for clarity

Column information for 'passengers' table:

         name     type
0      pclass  INTEGER
1    survived  INTEGER
2        name     TEXT
3         sex     TEXT
4         age     REAL
5       sibsp  INTEGER
6       parch  INTEGER
7      ticket     TEXT
8        fare     REAL
9       cabin     TEXT
10   embarked     TEXT
11       boat     TEXT
12       body     REAL
13  home.dest     TEXT

In [1]:
query = "select *"

In [2]:
# Close the database connection
conn.close()
print("Database connection closed")

NameError: name 'conn' is not defined

In [4]:
# Complete workflow in one cell
import pandas as pd
import sqlite3

# Step 1: Load CSV
df = pd.read_csv('Titanic Dataset (1).csv')
print(f"✅ Loaded {len(df)} rows from CSV")

# Step 2: Create database and connection
conn = sqlite3.connect('titanic.db')
print("✅ Connected to database")

# Step 3: Transfer data to database
df.to_sql('passengers', conn, if_exists='replace', index=False)
print("✅ Data transferred to 'passengers' table")

# Step 4: Query the database
query = "SELECT Name, Age, Survived FROM passengers LIMIT 5"
result = pd.read_sql(query, conn)
print("\n✅ Query results:")
display(result)

# Step 5: Close connection
conn.close()
print("\n✅ Connection closed")

✅ Loaded 1309 rows from CSV
✅ Connected to database
✅ Data transferred to 'passengers' table

✅ Query results:

                                              name    age  survived
0                    Allen, Miss. Elisabeth Walton  29.00         1
1                   Allison, Master. Hudson Trevor   0.92         1
2                     Allison, Miss. Helen Loraine   2.00         0
3             Allison, Mr. Hudson Joshua Creighton  30.00         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00         0

✅ Connection closed